enum Category { CAT}
enum Condition { Adoption, Disappear, Mating }

class Pet {

  String name;
  String information;
  Category category;
  String imageUrl;
  bool newest;

  Pet(this.name, this.information, this.category, this.imageUrl, this.newest);

}

List<Pet> getPetList(){
  return <Pet>[
    Pet(" แมวเปอร์เซีย ", "   เป็นราชินีแมวจากแดนตะวันออกกลาง มีถิ่นกำเนิด \nอยู่ในแถบเปอร์เซีย หรือประเทศตุรกีกับอิหร่าน \n เป็นแมวต่างประเทศสายพันธุ์แรกที่ถูกนำเข้ามา \n ในประเทศไทย พันธุ์นี้เป็นที่นิยมในหมู่คนรักแมว \n หน้าตาน่าเอ็นดู ขนปุกปุย นิสัยน่ารักมาก ๆ ", Category.CAT, "assets/images/1P.jpg", true),
    Pet(" แมวอเมริกัน ชอร์ตแฮร์ ", "   เป็นแมวสายพันธุ์อเมริกาที่สืบเชื้อสายมาจาก \n ประเทศในแถบยุโรปแพร่พันธุ์มายังอเมริกา \n เป็นแมวพื้นเมืองขนสั้นของอเมริกา ", Category.CAT, "assets/images/2A.jpg", true),
    Pet(" แมวสก็อตติช โฟลด์ ", " สก็อตติช โฟลด์ หรือแมวหูพับ \n เนื่องจากเป็นยีนส์ด้อยแต่ก็ทำให้ \n แมวสายพันธุ์นี้หัวกลมเหมือนนกฮูก  ", Category.CAT, "assets/images/3s.jpeg", true),
    Pet(" แมววิเชียรมาศ ", " เป็นแมวไทยที่ชาวต่างชาติรู้จักกันดี \n หรือแมวสยามตามตำนานหากใครได้เลี้ยงแมววิเชียรมาศ \n จะได้เป็นขุนนางเพราะถือว่าแมววิเชียรมาศ \n เป็นแมวแห่งโชคลาภ ", Category.CAT, "assets/images/4v.jpg", true),
    Pet(" สฟริงซ์ ", "  เป็นแมวที่ไม่มีขนทำให้มีลักษณะที่โดดเด่น \n ไม่เหมือนสายพันธุ์อื่นแต่ความจริงแมวสฟริงซ์ \n มีขนบางๆที่จมูกและหลังใบหู ", Category.CAT, "assets/images/5ss.jpg", true),
    Pet(" แมวบริติช ชอร์ตแฮร์ ", " เป็นแมวหน้าใหญ่สายพันธุ์เก่าแก่บนเกาะอังกฤษ \n สีที่เด่นและเป็นเอกลักษณ์ของสายพันธุ์นี้คือสีบลู \n หรือสีเทาเข้ม  ", Category.CAT, "assets/images/6.jpg", true),
    Pet(" แมวเมนคูน  ", " เมนคูนจัดเป็นแมวพี่ใหญ่ใจดี ", Category.CAT, "assets/images/7.jpg", true),
    Pet(" แมวเบงกอล  ", " เป็นแมวที่มีลวดลายสวยงามคล้ายลูกเสือดาวตัวน้อยๆ \n  เกิดจากการผสมพันธุ์ระหว่างแมวดาว \n กับแมวบ้านสายพันธุ์อียิปต์เชียนมัวร์ ", Category.CAT, "assets/images/8.jpg", true),


  ];
}
